In [55]:
import pandas as pd
import numpy as np
import seaborn as sns

In [56]:
df = sns.load_dataset('iris')
df.shape

(150, 5)

## Melt

In [57]:
pd.melt(df).head()

       variable value
0  sepal_length   5.1
1  sepal_length   4.9
2  sepal_length   4.7
3  sepal_length   4.6
4  sepal_length     5

In [58]:
pd.melt(df).describe()

       variable   value
count       750     750
unique        5      77
top     species  setosa
freq        150      50

## Concatenation

In [59]:
df_2 = sns.load_dataset('iris')
pd.concat([df,df_2]).head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

<strong> default: axis = 0 </strong>

In [60]:
pd.concat([df,df_2]).shape

(300, 5)

In [61]:
pd.concat([df,df_2],axis=1).shape

(150, 10)

## Pivot

In [62]:
df.drop_duplicates(subset='species', inplace=True)

In [63]:
df.pivot(index='species', columns='sepal_length', values='sepal_width')

sepal_length  5.1  6.3  7.0
species
setosa        3.5  NaN  NaN
versicolor    NaN  NaN  3.2
virginica     NaN  3.3  NaN